; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v7)
             (pred_2 ?v3 ?v4)
             (pred_8 ?v9 ?v4)
             (pred_3 ?v13 ?v9 )
	     (pred_6 ?v9)
             (pred_5 ?v8)
             (pred_4 ?v3)
             (pred_1 ?v4)
             (pred_12 ?v9)
             (pred_7 ?v3)
             (pred_11 ?v9)
             (pred_10 ))



(:action op_5
:parameters (?v10 ?v2 ?v11 ?v1)
:precondition (and (pred_5 ?v10) (pred_5 ?v2) (pred_4 ?v11) (pred_1 ?v1)
          (pred_9 ?v10 ?v2) (pred_2 ?v11 ?v1)
                   (pred_8 ?v2 ?v1) (pred_6 ?v10) 
                   (pred_12 ?v2) (pred_7 ?v11))
:effect (and  (pred_11 ?v2) (not (pred_12 ?v2))))


(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_5 ?v10) (pred_5 ?v6)
               (pred_6 ?v10) (pred_9 ?v10 ?v6) (pred_11 ?v6))
:effect (and (pred_6 ?v6) (not (pred_6 ?v10))))

(:action op_4
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_4 ?v11) 
                  (pred_6 ?v10) (pred_3 ?v11 ?v10) (pred_10 ))
:effect (and (pred_7 ?v11)
   (not (pred_3 ?v11 ?v10)) (not (pred_10 ))))


(:action op_3
:parameters (?v10 ?v12 ?v5)
:precondition (and (pred_5 ?v10) (pred_4 ?v12) (pred_4 ?v5)
                  (pred_6 ?v10) (pred_7 ?v5) (pred_3 ?v12 ?v10))
:effect (and (pred_7 ?v12) (pred_3 ?v5 ?v10)
        (not (pred_7 ?v5)) (not (pred_3 ?v12 ?v10))))

(:action op_2
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_4 ?v11) 
                  (pred_6 ?v10) (pred_7 ?v11))
:effect (and (pred_10 ) (pred_3 ?v11 ?v10) (not (pred_7 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_14 obj_13 obj_05 obj_12 obj_24 obj_19 obj_16 obj_28 obj_09 obj_02 obj_26 obj_06 obj_11 obj_08 obj_07 obj_29 obj_25 obj_01 obj_17 obj_21 obj_20 obj_18 obj_30 obj_15
    obj_27 obj_03
    obj_22 obj_23 obj_04
    )

    (:init
       (pred_10)

       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_24)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_5 obj_28)
       (pred_5 obj_09)
       (pred_5 obj_02)
       (pred_5 obj_26)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_29)
       (pred_5 obj_25)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_21)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_5 obj_30)
       (pred_5 obj_15)
       (pred_1 obj_27)
       (pred_1 obj_03)
       (pred_4 obj_22)
       (pred_4 obj_23)
       (pred_4 obj_04)

       (pred_9 obj_10 obj_24)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_05 obj_28)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_24 obj_02)
       (pred_9 obj_24 obj_19)
       (pred_9 obj_24 obj_10)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_19 obj_24)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_28)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_28 obj_11)
       (pred_9 obj_28 obj_09)
       (pred_9 obj_28 obj_05)
       (pred_9 obj_28 obj_16)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_28)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_02 obj_26)
       (pred_9 obj_02 obj_24)
       (pred_9 obj_26 obj_29)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_02)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_28)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_29)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_26)
       (pred_9 obj_29 obj_07)
       (pred_9 obj_25 obj_18)
       (pred_9 obj_25 obj_01)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_25)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_20 obj_18)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_18 obj_30)
       (pred_9 obj_18 obj_25)
       (pred_9 obj_18 obj_20)
       (pred_9 obj_30 obj_15)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_30 obj_18)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_30)
       (pred_12 obj_28)
       (pred_12 obj_20)
       (pred_12 obj_30)
       (pred_8  obj_28 obj_27)
       (pred_8  obj_20 obj_03)
       (pred_8  obj_30 obj_27)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_12)
       (pred_11 obj_24)
       (pred_11 obj_19)
       (pred_11 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_26)
       (pred_11 obj_06)
       (pred_11 obj_11)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_29)
       (pred_11 obj_25)
       (pred_11 obj_01)
       (pred_11 obj_17)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_15)

       (pred_2  obj_22 obj_27)
       (pred_2  obj_23 obj_03)
       (pred_2  obj_04 obj_27)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_23 obj_19)
       (pred_3 obj_04 obj_10)
       (pred_6 obj_12)
    )

    (:goal (and
       (pred_3 obj_22 obj_24)
       (pred_3 obj_23 obj_10)
       (pred_3 obj_04 obj_13)
    ))
(:constraints
  (always (not (pred_6 obj_02)))
)
)

; plan
1. (op_1 obj_12 obj_05)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_05)
   goals met: 0 of 3
2. (op_1 obj_05 obj_13)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_13)
   goals met: 0 of 3
3. (op_1 obj_13 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_14)
   goals met: 0 of 3
4. (op_1 obj_14 obj_19)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_19)
   goals met: 0 of 3
5. (op_4 obj_19 obj_23)
   deleted: (pred_3 obj_23 obj_19) (pred_10)
   added: (pred_7 obj_23)
   goals met: 0 of 3
6. (op_1 obj_19 obj_24)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_24)
   goals met: 0 of 3
7. (op_1 obj_24 obj_10)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_10)
   goals met: 0 of 3
8. (op_3 obj_10 obj_04 obj_23)
   deleted: (pred_7 obj_23) (pred_3 obj_04 obj_10)
   added: (pred_7 obj_04) (pred_3 obj_23 obj_10)
   goals met: 1 of 3
9. (op_1 obj_10 obj_14)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_14)
   goals met: 1 of 3
10. (op_1 obj_14 obj_13)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_13)
   goals met: 1 of 3
11. (op_2 obj_13 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_10) (pred_3 obj_04 obj_13)
   goals met: 2 of 3
12. (op_1 obj_13 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_14)
   goals met: 2 of 3
13. (op_1 obj_14 obj_19)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_19)
   goals met: 2 of 3
14. (op_1 obj_19 obj_26)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_26)
   goals met: 2 of 3
15. (op_1 obj_26 obj_29)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_29)
   goals met: 2 of 3
16. (op_1 obj_29 obj_07)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_07)
   goals met: 2 of 3
17. (op_1 obj_07 obj_21)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_21)
   goals met: 2 of 3
18. (op_4 obj_21 obj_22)
   deleted: (pred_3 obj_22 obj_21) (pred_10)
   added: (pred_7 obj_22)
   goals met: 2 of 3
19. (op_1 obj_21 obj_07)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_07)
   goals met: 2 of 3
20. (op_1 obj_07 obj_29)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_29)
   goals met: 2 of 3
21. (op_1 obj_29 obj_26)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_26)
   goals met: 2 of 3
22. (op_1 obj_26 obj_19)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_19)
   goals met: 2 of 3
23. (op_1 obj_19 obj_24)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_24)
   goals met: 2 of 3
24. (op_2 obj_24 obj_22)
   deleted: (pred_7 obj_22)
   added: (pred_10) (pred_3 obj_22 obj_24)
   goals met: 3 of 3
